app/views/admin/pages/_form.html.haml

SELECT "categories".* FROM "categories"
---
    = f.label :category_id
    = f.collection_select :category_id, Category.all, :id, :name, class: "form-control"
  .actions