app/views/admin/pages/index.html.haml

SELECT "types".* FROM "types"
---
  = link_to 'New Page', new_admin_page_path, class: 'btn btn-primary'
  - Type.all.each do |type|