app/controllers/admin/menus_controller.rb

SELECT "menus".* FROM "menus"
---
    def index
      @menus = Menu.all

INSERT INTO "menus" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Main Nav"], ["created_at", "2016-06-04 03:04:58.362863"], ["updated_at", "2016-06-04 03:04:58.362863"]]
---
    def create
      @menu = Menu.new(menu_params)
      if @menu.save

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", 2]]
---
    def update
      @menu = Menu.find(params[:id])

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", 1]]
---
    def edit
      @menu = Menu.find(params[:id])