app/controllers/admin/pages_controller.rb

SELECT "pages".* FROM "pages"
---
    def index
      @pages = Page.all

SELECT  "types".* FROM "types" WHERE "types"."name" = ?  ORDER BY "types"."id" ASC LIMIT 1  [["name", "image"]]
SELECT "field_definitions".* FROM "field_definitions" WHERE "field_definitions"."type_id" = ?  [["type_id", 4]]
---
    def new
      @page = Page.new(type: Type.where(name: params[:type]).first)
      @page.type.field_definitions.each do |defin|

INSERT INTO "pages" ("title", "body", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "First PAge"], ["body", "this page can say whatever now"], ["slug", "first-page"], ["created_at", "2016-06-03 17:50:29.687571"], ["updated_at", "2016-06-03 17:50:29.687571"]]
---
    def create
      @page = Page.new(page_params)
      if @page.save

UPDATE "pages" SET "body" = ?, "updated_at" = ? WHERE "pages"."id" = ?  [["body", "<p>This is the second Page</p>\r\n\r\n<p><strong>ADSdsa</strong></p>\r\n"], ["updated_at", "2016-06-03 22:31:53.217327"], ["id", 2]]
---
    def update
      if @page.update(page_params)

DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 1]]
---
    def destroy
      if @page.destroy

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", 1]]
---
      def set_page
        @page = Page.find(params[:id])