app/controllers/admin/types_controller.rb

    def index
      @types = Type.all
---
SELECT "types".* FROM "types"

    def create
      @type = Type.new(type_params)
      if @type.save
---
INSERT INTO "types" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2016-06-05 05:01:23.330006"], ["updated_at", "2016-06-05 05:01:23.330006"]]

    def update
      @type = Type.find(params[:id])
      if @type.update_attributes(type_params)
---
SELECT  "types".* FROM "types" WHERE "types"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "types" SET "name" = ?, "updated_at" = ? WHERE "types"."id" = ?  [["name", "NEeds a Name "], ["updated_at", "2016-06-05 05:10:13.484621"], ["id", 1]]

    def edit
      @type = Type.find(params[:id])
---
SELECT  "types".* FROM "types" WHERE "types"."id" = ? LIMIT 1  [["id", 1]]