app/views/admin/types/index.html.haml

SELECT "field_definitions".* FROM "field_definitions" WHERE "field_definitions"."type_id" = ?  [["type_id", 1]]
---
    %ul
      - type.field_definitions.each do |field|