app/views/pages/show.html.haml

SELECT "fields".* FROM "fields" WHERE "fields"."page_id" = ?  [["page_id", 7]]
---
%dl
  - @page.fields.each do |f|