app/controllers/pages_controller.rb

  def show
    @page = Page.find(params[:id])
---
SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", 1]]