app/views/categories/show.html.haml

SELECT "pages".* FROM "pages" WHERE "pages"."category_id" = ?  [["category_id", 1]]
---
.table-padding
  - @category.pages.each do | page |