app/views/admin/menus/index.html.haml

SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."menu_id" = ?  [["menu_id", 2]]
SELECT "menus".* FROM "menus"
---
    %ul
      - menu.menu_items.each do |menu_item|